ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR64DB48def.inc
.equ OPAMP_CTRLA = 0x0700                ; Control A
.equ OPAMP_DBGCTRL = 0x0701              ; Debug Control
.equ OPAMP_TIMEBASE = 0x0702             ; Timebase Value
.equ OPAMP_PWRCTRL = 0x070F              ; Power Control
.equ OPAMP_OP0CTRLA = 0x0710             ; Op Amp 0 Control A
.equ OPAMP_OP0STATUS = 0x0711            ; Op Amp 0 Status
.equ OPAMP_OP0RESMUX = 0x0712            ; Op Amp 0 Resistor Ladder Multiplexer
.equ OPAMP_OP0INMUX = 0x0713             ; Op Amp 0 Input Multiplexer
.equ OPAMP_OP0SETTLE = 0x0714            ; Op Amp 0 Settle
.equ OPAMP_OP0CAL = 0x0715               ; Op Amp 0 Calibration
.equ OPAMP_OP1CTRLA = 0x0718             ; Op Amp 1 Control A
.equ OPAMP_OP1STATUS = 0x0719            ; Op Amp 1 Status
.equ OPAMP_OP1RESMUX = 0x071A            ; Op Amp 1 Resistor Ladder Multiplexer
.equ OPAMP_OP1INMUX = 0x071B             ; Op Amp 1 Input Multiplexer
.equ OPAMP_OP1SETTLE = 0x071C            ; Op Amp 1 Settle
.equ OPAMP_OP1CAL = 0x071D               ; Op Amp 1 Calibration
.equ OPAMP_OP2CTRLA = 0x0720             ; Op Amp 2 Control A
.equ OPAMP_OP2STATUS = 0x0721            ; Op Amp 2 Status
.equ OPAMP_OP2RESMUX = 0x0722            ; Op Amp 2 Resistor Ladder Multiplexer
.equ OPAMP_OP2INMUX = 0x0723             ; Op Amp 2 Input Multiplexer
.equ OPAMP_OP2SETTLE = 0x0724            ; Op Amp 2 Settle
.equ OPAMP_OP2CAL = 0x0725               ; Op Amp 2 Calibration

;*************************************************************************
;** PORTA - I/O Ports
;*************************************************************************

.equ PORTA_DIR = 0x0400                  ; Data Direction
.equ PORTA_DIRSET = 0x0401               ; Data Direction Set
.equ PORTA_DIRCLR = 0x0402               ; Data Direction Clear
.equ PORTA_DIRTGL = 0x0403               ; Data Direction Toggle
.equ PORTA_OUT = 0x0404                  ; Output Value
.equ PORTA_OUTSET = 0x0405               ; Output Value Set
.equ PORTA_OUTCLR = 0x0406               ; Output Value Clear
.equ PORTA_OUTTGL = 0x0407               ; Output Value Toggle
.equ PORTA_IN = 0x0408                   ; Input Value
.equ PORTA_INTFLAGS = 0x0409             ; Interrupt Flags
.equ PORTA_PORTCTRL = 0x040A             ; Port Control
.equ PORTA_PINCONFIG = 0x040B            ; Pin Control Config
.equ PORTA_PINCTRLUPD = 0x040C           ; Pin Control Update
.equ PORTA_PINCTRLSET = 0x040D           ; Pin Control Set
.equ PORTA_PINCTRLCLR = 0x040E           ; Pin Control Clear
.equ PORTA_PIN0CTRL = 0x0410             ; Pin 0 Control
.equ PORTA_PIN1CTRL = 0x0411             ; Pin 1 Control
.equ PORTA_PIN2CTRL = 0x0412             ; Pin 2 Control
.equ PORTA_PIN3CTRL = 0x0413             ; Pin 3 Control
.equ PORTA_PIN4CTRL = 0x0414             ; Pin 4 Control
.equ PORTA_PIN5CTRL = 0x0415             ; Pin 5 Control
.equ PORTA_PIN6CTRL = 0x0416             ; Pin 6 Control
.equ PORTA_PIN7CTRL = 0x0417             ; Pin 7 Control

;*************************************************************************
;** PORTB - I/O Ports
;*************************************************************************

.equ PORTB_DIR = 0x0420                  ; Data Direction
.equ PORTB_DIRSET = 0x0421               ; Data Direction Set
.equ PORTB_DIRCLR = 0x0422               ; Data Direction Clear
.equ PORTB_DIRTGL = 0x0423               ; Data Direction Toggle
.equ PORTB_OUT = 0x0424                  ; Output Value
.equ PORTB_OUTSET = 0x0425               ; Output Value Set
.equ PORTB_OUTCLR = 0x0426               ; Output Value Clear
.equ PORTB_OUTTGL = 0x0427               ; Output Value Toggle
.equ PORTB_IN = 0x0428                   ; Input Value
.equ PORTB_INTFLAGS = 0x0429             ; Interrupt Flags
.equ PORTB_PORTCTRL = 0x042A             ; Port Control
.equ PORTB_PINCONFIG = 0x042B            ; Pin Control Config
.equ PORTB_PINCTRLUPD = 0x042C           ; Pin Control Update
.equ PORTB_PINCTRLSET = 0x042D           ; Pin Control Set
.equ PORTB_PINCTRLCLR = 0x042E           ; Pin Control Clear
.equ PORTB_PIN0CTRL = 0x0430             ; Pin 0 Control
.equ PORTB_PIN1CTRL = 0x0431             ; Pin 1 Control
.equ PORTB_PIN2CTRL = 0x0432             ; Pin 2 Control
.equ PORTB_PIN3CTRL = 0x0433             ; Pin 3 Control
.equ PORTB_PIN4CTRL = 0x0434             ; Pin 4 Control
.equ PORTB_PIN5CTRL = 0x0435             ; Pin 5 Control
.equ PORTB_PIN6CTRL = 0x0436             ; Pin 6 Control
.equ PORTB_PIN7CTRL = 0x0437             ; Pin 7 Control

;*************************************************************************
;** PORTC - I/O Ports
;*************************************************************************

.equ PORTC_DIR = 0x0440                  ; Data Direction
.equ PORTC_DIRSET = 0x0441               ; Data Direction Set
.equ PORTC_DIRCLR = 0x0442               ; Data Direction Clear
.equ PORTC_DIRTGL = 0x0443               ; Data Direction Toggle
.equ PORTC_OUT = 0x0444                  ; Output Value
.equ PORTC_OUTSET = 0x0445               ; Output Value Set
.equ PORTC_OUTCLR = 0x0446               ; Output Value Clear
.equ PORTC_OUTTGL = 0x0447               ; Output Value Toggle
.equ PORTC_IN = 0x0448                   ; Input Value
.equ PORTC_INTFLAGS = 0x0449             ; Interrupt Flags
.equ PORTC_PORTCTRL = 0x044A             ; Port Control
.equ PORTC_PINCONFIG = 0x044B            ; Pin Control Config
.equ PORTC_PINCTRLUPD = 0x044C           ; Pin Control Update
.equ PORTC_PINCTRLSET = 0x044D           ; Pin Control Set
.equ PORTC_PINCTRLCLR = 0x044E           ; Pin Control Clear
.equ PORTC_PIN0CTRL = 0x0450             ; Pin 0 Control
.equ PORTC_PIN1CTRL = 0x0451             ; Pin 1 Control
.equ PORTC_PIN2CTRL = 0x0452             ; Pin 2 Control
.equ PORTC_PIN3CTRL = 0x0453             ; Pin 3 Control
.equ PORTC_PIN4CTRL = 0x0454             ; Pin 4 Control
.equ PORTC_PIN5CTRL = 0x0455             ; Pin 5 Control
.equ PORTC_PIN6CTRL = 0x0456             ; Pin 6 Control
.equ PORTC_PIN7CTRL = 0x0457             ; Pin 7 Control

;*************************************************************************
;** PORTD - I/O Ports
;*************************************************************************

