ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR64DB48def.inc
; NVMCTRL_CTRLA masks
.equ NVMCTRL_CMD_gm = 0x7F               ; Command group mask
.equ NVMCTRL_CMD_gp = 0                  ; Command group position
.equ NVMCTRL_CMD_0_bm = (1<<0)           ; Command bit 0 mask
.equ NVMCTRL_CMD_0_bp = 0                ; Command bit 0 position
.equ NVMCTRL_CMD_1_bm = (1<<1)           ; Command bit 1 mask
.equ NVMCTRL_CMD_1_bp = 1                ; Command bit 1 position
.equ NVMCTRL_CMD_2_bm = (1<<2)           ; Command bit 2 mask
.equ NVMCTRL_CMD_2_bp = 2                ; Command bit 2 position
.equ NVMCTRL_CMD_3_bm = (1<<3)           ; Command bit 3 mask
.equ NVMCTRL_CMD_3_bp = 3                ; Command bit 3 position
.equ NVMCTRL_CMD_4_bm = (1<<4)           ; Command bit 4 mask
.equ NVMCTRL_CMD_4_bp = 4                ; Command bit 4 position
.equ NVMCTRL_CMD_5_bm = (1<<5)           ; Command bit 5 mask
.equ NVMCTRL_CMD_5_bp = 5                ; Command bit 5 position
.equ NVMCTRL_CMD_6_bm = (1<<6)           ; Command bit 6 mask
.equ NVMCTRL_CMD_6_bp = 6                ; Command bit 6 position

; NVMCTRL_CTRLB masks
.equ NVMCTRL_APPCODEWP_bm = 0x01         ; Application Code Write Protect bit mask
.equ NVMCTRL_APPCODEWP_bp = 0            ; Application Code Write Protect bit position
.equ NVMCTRL_BOOTRP_bm = 0x02            ; Boot Read Protect bit mask
.equ NVMCTRL_BOOTRP_bp = 1               ; Boot Read Protect bit position
.equ NVMCTRL_APPDATAWP_bm = 0x04         ; Application Data Write Protect bit mask
.equ NVMCTRL_APPDATAWP_bp = 2            ; Application Data Write Protect bit position
.equ NVMCTRL_FLMAP_gm = 0x30             ; Flash Mapping in Data space group mask
.equ NVMCTRL_FLMAP_gp = 4                ; Flash Mapping in Data space group position
.equ NVMCTRL_FLMAP_0_bm = (1<<4)         ; Flash Mapping in Data space bit 0 mask
.equ NVMCTRL_FLMAP_0_bp = 4              ; Flash Mapping in Data space bit 0 position
.equ NVMCTRL_FLMAP_1_bm = (1<<5)         ; Flash Mapping in Data space bit 1 mask
.equ NVMCTRL_FLMAP_1_bp = 5              ; Flash Mapping in Data space bit 1 position
.equ NVMCTRL_FLMAPLOCK_bm = 0x80         ; Flash Mapping Lock bit mask
.equ NVMCTRL_FLMAPLOCK_bp = 7            ; Flash Mapping Lock bit position

; NVMCTRL_STATUS masks
.equ NVMCTRL_FBUSY_bm = 0x01             ; Flash busy bit mask
.equ NVMCTRL_FBUSY_bp = 0                ; Flash busy bit position
.equ NVMCTRL_EEBUSY_bm = 0x02            ; EEPROM busy bit mask
.equ NVMCTRL_EEBUSY_bp = 1               ; EEPROM busy bit position
.equ NVMCTRL_ERROR_gm = 0x70             ; Write error group mask
.equ NVMCTRL_ERROR_gp = 4                ; Write error group position
.equ NVMCTRL_ERROR_0_bm = (1<<4)         ; Write error bit 0 mask
.equ NVMCTRL_ERROR_0_bp = 4              ; Write error bit 0 position
.equ NVMCTRL_ERROR_1_bm = (1<<5)         ; Write error bit 1 mask
.equ NVMCTRL_ERROR_1_bp = 5              ; Write error bit 1 position
.equ NVMCTRL_ERROR_2_bm = (1<<6)         ; Write error bit 2 mask
.equ NVMCTRL_ERROR_2_bp = 6              ; Write error bit 2 position

; NVMCTRL_INTCTRL masks
.equ NVMCTRL_EEREADY_bm = 0x01           ; EEPROM Ready bit mask
.equ NVMCTRL_EEREADY_bp = 0              ; EEPROM Ready bit position

; NVMCTRL_INTFLAGS masks
; Masks for NVMCTRL_EEREADY already defined

; Command select
.equ NVMCTRL_CMD_NONE_gc = (0x00<<0)     ; No Command
.equ NVMCTRL_CMD_NOOP_gc = (0x01<<0)     ; No Operation
.equ NVMCTRL_CMD_FLWR_gc = (0x02<<0)     ; Flash Write
.equ NVMCTRL_CMD_FLPER_gc = (0x08<<0)    ; Flash Page Erase
.equ NVMCTRL_CMD_FLMPER2_gc = (0x09<<0)  ; Flash Multi-Page Erase 2 pages
.equ NVMCTRL_CMD_FLMPER4_gc = (0x0A<<0)  ; Flash Multi-Page Erase 4 pages
.equ NVMCTRL_CMD_FLMPER8_gc = (0x0B<<0)  ; Flash Multi-Page Erase 8 pages
.equ NVMCTRL_CMD_FLMPER16_gc = (0x0C<<0) ; Flash Multi-Page Erase 16 pages
.equ NVMCTRL_CMD_FLMPER32_gc = (0x0D<<0) ; Flash Multi-Page Erase 32 pages
.equ NVMCTRL_CMD_EEWR_gc = (0x12<<0)     ; EEPROM Write
.equ NVMCTRL_CMD_EEERWR_gc = (0x13<<0)   ; EEPROM Erase and Write
.equ NVMCTRL_CMD_EEBER_gc = (0x18<<0)    ; EEPROM Byte Erase
.equ NVMCTRL_CMD_EEMBER2_gc = (0x19<<0)  ; EEPROM Multi-Byte Erase 2 bytes
.equ NVMCTRL_CMD_EEMBER4_gc = (0x1A<<0)  ; EEPROM Multi-Byte Erase 4 bytes
.equ NVMCTRL_CMD_EEMBER8_gc = (0x1B<<0)  ; EEPROM Multi-Byte Erase 8 bytes
.equ NVMCTRL_CMD_EEMBER16_gc = (0x1C<<0) ; EEPROM Multi-Byte Erase 16 bytes
.equ NVMCTRL_CMD_EEMBER32_gc = (0x1D<<0) ; EEPROM Multi-Byte Erase 32 bytes
.equ NVMCTRL_CMD_CHER_gc = (0x20<<0)     ; Chip Erase Command
.equ NVMCTRL_CMD_EECHER_gc = (0x30<<0)   ; EEPROM Erase Command

; Flash Mapping in Data space select
.equ NVMCTRL_FLMAP_SECTION0_gc = (0x00<<4) ; Flash section 0
.equ NVMCTRL_FLMAP_SECTION1_gc = (0x01<<4) ; Flash section 1
.equ NVMCTRL_FLMAP_SECTION2_gc = (0x02<<4) ; Flash section 2
.equ NVMCTRL_FLMAP_SECTION3_gc = (0x03<<4) ; Flash section 3

; Write error select
.equ NVMCTRL_ERROR_NOERROR_gc = (0x00<<4) ; No Error
.equ NVMCTRL_ERROR_ILLEGALCMD_gc = (0x01<<4) ; Write command not selected
.equ NVMCTRL_ERROR_ILLEGALSADDR_gc = (0x02<<4) ; Write to section not allowed
.equ NVMCTRL_ERROR_DOUBLESELECT_gc = (0x03<<4) ; Selecting new write command while write command already seleted
.equ NVMCTRL_ERROR_ONGOINGPROG_gc = (0x04<<4) ; Starting a new programming operation before previous is completed


;*************************************************************************
;** OPAMP - Operational Amplifier System
;*************************************************************************

; OPAMP_CTRLA masks
.equ OPAMP_ENABLE_bm = 0x01              ; Op Amp System Enable bit mask
.equ OPAMP_ENABLE_bp = 0                 ; Op Amp System Enable bit position

; OPAMP_DBGCTRL masks
.equ OPAMP_DBGRUN_bm = 0x01              ; Run in Debug Mode bit mask
.equ OPAMP_DBGRUN_bp = 0                 ; Run in Debug Mode bit position

; OPAMP_TIMEBASE masks
.equ OPAMP_TIMEBASE_gm = 0x7F            ; Timebase Value group mask
.equ OPAMP_TIMEBASE_gp = 0               ; Timebase Value group position
.equ OPAMP_TIMEBASE_0_bm = (1<<0)        ; Timebase Value bit 0 mask
.equ OPAMP_TIMEBASE_0_bp = 0             ; Timebase Value bit 0 position
.equ OPAMP_TIMEBASE_1_bm = (1<<1)        ; Timebase Value bit 1 mask
.equ OPAMP_TIMEBASE_1_bp = 1             ; Timebase Value bit 1 position
.equ OPAMP_TIMEBASE_2_bm = (1<<2)        ; Timebase Value bit 2 mask
.equ OPAMP_TIMEBASE_2_bp = 2             ; Timebase Value bit 2 position
.equ OPAMP_TIMEBASE_3_bm = (1<<3)        ; Timebase Value bit 3 mask
.equ OPAMP_TIMEBASE_3_bp = 3             ; Timebase Value bit 3 position
.equ OPAMP_TIMEBASE_4_bm = (1<<4)        ; Timebase Value bit 4 mask
.equ OPAMP_TIMEBASE_4_bp = 4             ; Timebase Value bit 4 position
.equ OPAMP_TIMEBASE_5_bm = (1<<5)        ; Timebase Value bit 5 mask
.equ OPAMP_TIMEBASE_5_bp = 5             ; Timebase Value bit 5 position
.equ OPAMP_TIMEBASE_6_bm = (1<<6)        ; Timebase Value bit 6 mask
.equ OPAMP_TIMEBASE_6_bp = 6             ; Timebase Value bit 6 position

; OPAMP_PWRCTRL masks
.equ OPAMP_IRSEL_bm = 0x01               ; Input Range Select bit mask
.equ OPAMP_IRSEL_bp = 0                  ; Input Range Select bit position

; OPAMP_OP0CTRLA masks
.equ OPAMP_ALWAYSON_bm = 0x01            ; Always On bit mask
.equ OPAMP_ALWAYSON_bp = 0               ; Always On bit position
.equ OPAMP_EVENTEN_bm = 0x02             ; Enable Events bit mask
.equ OPAMP_EVENTEN_bp = 1                ; Enable Events bit position
.equ OPAMP_OUTMODE_gm = 0x0C             ; Output Mode group mask
.equ OPAMP_OUTMODE_gp = 2                ; Output Mode group position
.equ OPAMP_OUTMODE_0_bm = (1<<2)         ; Output Mode bit 0 mask
.equ OPAMP_OUTMODE_0_bp = 2              ; Output Mode bit 0 position
.equ OPAMP_OUTMODE_1_bm = (1<<3)         ; Output Mode bit 1 mask
.equ OPAMP_OUTMODE_1_bp = 3              ; Output Mode bit 1 position
.equ OPAMP_RUNSTBY_bm = 0x80             ; Run in Standby Mode bit mask
.equ OPAMP_RUNSTBY_bp = 7                ; Run in Standby Mode bit position

; OPAMP_OP0STATUS masks
.equ OPAMP_SETTLED_bm = 0x01             ; Settled bit mask
.equ OPAMP_SETTLED_bp = 0                ; Settled bit position

; OPAMP_OP0RESMUX masks
.equ OPAMP_MUXTOP_gm = 0x03              ; Multiplexer Top group mask
.equ OPAMP_MUXTOP_gp = 0                 ; Multiplexer Top group position
.equ OPAMP_MUXTOP_0_bm = (1<<0)          ; Multiplexer Top bit 0 mask
.equ OPAMP_MUXTOP_0_bp = 0               ; Multiplexer Top bit 0 position
.equ OPAMP_MUXTOP_1_bm = (1<<1)          ; Multiplexer Top bit 1 mask
.equ OPAMP_MUXTOP_1_bp = 1               ; Multiplexer Top bit 1 position
.equ OPAMP_MUXBOT_gm = 0x1C              ; Multiplexer Bottom group mask
.equ OPAMP_MUXBOT_gp = 2                 ; Multiplexer Bottom group position
.equ OPAMP_MUXBOT_0_bm = (1<<2)          ; Multiplexer Bottom bit 0 mask
.equ OPAMP_MUXBOT_0_bp = 2               ; Multiplexer Bottom bit 0 position
.equ OPAMP_MUXBOT_1_bm = (1<<3)          ; Multiplexer Bottom bit 1 mask
.equ OPAMP_MUXBOT_1_bp = 3               ; Multiplexer Bottom bit 1 position
.equ OPAMP_MUXBOT_2_bm = (1<<4)          ; Multiplexer Bottom bit 2 mask
.equ OPAMP_MUXBOT_2_bp = 4               ; Multiplexer Bottom bit 2 position
.equ OPAMP_MUXWIP_gm = 0xE0              ; Multiplexer Wiper selector group mask
.equ OPAMP_MUXWIP_gp = 5                 ; Multiplexer Wiper selector group position
.equ OPAMP_MUXWIP_0_bm = (1<<5)          ; Multiplexer Wiper selector bit 0 mask
.equ OPAMP_MUXWIP_0_bp = 5               ; Multiplexer Wiper selector bit 0 position
.equ OPAMP_MUXWIP_1_bm = (1<<6)          ; Multiplexer Wiper selector bit 1 mask
.equ OPAMP_MUXWIP_1_bp = 6               ; Multiplexer Wiper selector bit 1 position
.equ OPAMP_MUXWIP_2_bm = (1<<7)          ; Multiplexer Wiper selector bit 2 mask
.equ OPAMP_MUXWIP_2_bp = 7               ; Multiplexer Wiper selector bit 2 position

; OPAMP_OP0INMUX masks
.equ OPAMP_MUXPOS_gm = 0x07              ; Positive Input Multiplexer group mask
.equ OPAMP_MUXPOS_gp = 0                 ; Positive Input Multiplexer group position
.equ OPAMP_MUXPOS_0_bm = (1<<0)          ; Positive Input Multiplexer bit 0 mask
.equ OPAMP_MUXPOS_0_bp = 0               ; Positive Input Multiplexer bit 0 position
.equ OPAMP_MUXPOS_1_bm = (1<<1)          ; Positive Input Multiplexer bit 1 mask
.equ OPAMP_MUXPOS_1_bp = 1               ; Positive Input Multiplexer bit 1 position
.equ OPAMP_MUXPOS_2_bm = (1<<2)          ; Positive Input Multiplexer bit 2 mask
.equ OPAMP_MUXPOS_2_bp = 2               ; Positive Input Multiplexer bit 2 position
.equ OPAMP_MUXNEG_gm = 0x70              ; Negative Input Multiplexer group mask
.equ OPAMP_MUXNEG_gp = 4                 ; Negative Input Multiplexer group position
.equ OPAMP_MUXNEG_0_bm = (1<<4)          ; Negative Input Multiplexer bit 0 mask
.equ OPAMP_MUXNEG_0_bp = 4               ; Negative Input Multiplexer bit 0 position
.equ OPAMP_MUXNEG_1_bm = (1<<5)          ; Negative Input Multiplexer bit 1 mask
.equ OPAMP_MUXNEG_1_bp = 5               ; Negative Input Multiplexer bit 1 position
.equ OPAMP_MUXNEG_2_bm = (1<<6)          ; Negative Input Multiplexer bit 2 mask
.equ OPAMP_MUXNEG_2_bp = 6               ; Negative Input Multiplexer bit 2 position

